---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalLink.StartHubId
source: html/7f083a84-b3d1-a32f-80cb-a4b7374ead71.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLink.StartHubId Property

Hub ID at start of AnalyticalLink.

## Syntax (C#)
```csharp
public ElementId StartHubId { get; }
```